import pymysql


link = pymysql.connect(
	host = "34.71.74.214",
	user = "root",
	passwd = '1qaz2wsx#EDC',
	db = "team_project",
	charset = "utf8",
	port = 3306
)

cursor = link.cursor()

cursor.execute("CALL fetch_crop_data2 (1,'2021-07-29',8)")

for data in cursor.fetchall():
    print(data)

link.close()

# 查詢範例：cursor.execute("CALL fetch_crop_data2 (1,'2021-07-29',8)")
# fetch_crop_data 參數：(查詢類別, 查詢時間, 市場id)
# 查詢類別：輸入1
# 	輸出：(日期,市場,類別,產品,交易量,批發價,7日後預測批發價)
# 查詢時間：請以字串方式代入
# 市場id：
# '1','南投市','蔬菜'
# '2','屏東市','蔬菜'
# '3','永靖鄉','蔬菜'
# '4','西螺鎮','蔬菜'
# '5','高雄市','蔬菜'
# '6','鳳山區','蔬菜'
# '7','台中市','蔬菜'
# '8','台北一','蔬菜'
# '9','台北二','蔬菜'
# '10','台東市','蔬菜'
# '11','溪湖鎮','蔬菜'
# '12','花蓮市','蔬菜'
# '13','三重區','蔬菜'
# '14','桃　農','蔬菜'
# '15','宜蘭市','蔬菜'
# '16','豐原區','蔬菜'
# '17','板橋區','蔬菜'
# '18','三重區','水果'
# '19','嘉義市','水果'
# '20','高雄市','水果'
# '21','鳳山區','水果'
# '22','台中市','水果'
# '23','台北一','水果'
# '24','台北二','水果'
# '25','台東市','水果'
# '26','東勢區','水果'
# '27','桃　農','水果'
# '28','宜蘭市','水果'
# '29','豐原區','水果'
# '30','板橋區','水果'
