import pymysql


link = pymysql.connect(
	host = "34.71.74.214",
	user = "root",
	passwd = '1qaz2wsx#EDC',
	db = "team_project",
	charset = "utf8",
	port = 3306
)

cursor = link.cursor()

cursor.execute("CALL fetch_crop_data (1,'2021-06-14',23,23)")

# 此行是回傳欄位名稱
column_names = tuple([i[0] for i in cursor.description])
print(column_names)

for data in cursor.fetchall():
    print(data)

link.close()

# 查詢範例：cursor.execute("CALL fetch_crop_data (1,'2021-06-29',15,8)")
# fetch_crop_data 參數：(查詢類別, 查詢時間, 農產品id, 市場id)
# 查詢類別：
# 	1：歷史零售價資料：
# 		輸出：(日期,市場,產品,零售價)
# 	2：預測資料：
#		輸出：(日期,市場,產品,零售價)
# 查詢時間：請以字串方式代入
# 農產品id：
# '1','高麗菜','LA1 甘藍 初秋 '
# '2','胡蘿蔔','SB2 胡蘿蔔 清洗 '
# '3','牛番茄','FJ3 番茄 牛蕃茄 '
# '4','胡瓜','FD1 花胡瓜  '
# '5','絲瓜','FF1 絲瓜  '
# '6','包心白菜','LC1 包心白 包白 '
# '7','青蔥','SE6 青蔥 粉蔥 '
# '8','苦瓜','FG1 苦瓜 白大米 '
# '9','洋蔥','SD1 洋蔥 本產 '
# '10','空心菜','LF2 蕹菜 小葉 '
# '11','番石榴','P1 番石榴 珍珠芭 '
# '12','鳳梨','B2 鳳梨 金鑽鳳梨 '
# '13','木瓜','I1 木瓜 網室紅肉 '
# '14','西瓜','T1 西瓜 大西瓜 '
# '15','香蕉','A1 香蕉  '
# '16','蘋果','X69 蘋果 富士進口 '
# '17','梨子','O4 梨 新興梨 '
# '18','葡萄','S1 葡萄 巨峰 '
# '19','火龍果','812 火龍果 紅肉 '
# '20','芒果','R1 芒果 愛文 '
# '21','青江菜','LD1 青江白菜 小梗 '
# '22','花椰菜','FB11 花椰菜 青梗 留梗柄'
# '23','檸檬','F1 雜柑 檸檬 '
# '24','小番茄','74 小番茄 玉女 '

# 市場id：
# '1','南投市','蔬菜'
# '2','屏東市','蔬菜'
# '3','永靖鄉','蔬菜'
# '4','西螺鎮','蔬菜'
# '5','高雄市','蔬菜'
# '6','鳳山區','蔬菜'
# '7','台中市','蔬菜'
# '8','台北一','蔬菜'
# '9','台北二','蔬菜'
# '10','台東市','蔬菜'
# '11','溪湖鎮','蔬菜'
# '12','花蓮市','蔬菜'
# '13','三重區','蔬菜'
# '14','桃　農','蔬菜'
# '15','宜蘭市','蔬菜'
# '16','豐原區','蔬菜'
# '17','板橋區','蔬菜'
# '18','三重區','水果'
# '19','嘉義市','水果'
# '20','高雄市','水果'
# '21','鳳山區','水果'
# '22','台中市','水果'
# '23','台北一','水果'
# '24','台北二','水果'
# '25','台東市','水果'
# '26','東勢區','水果'
# '27','桃　農','水果'
# '28','宜蘭市','水果'
# '29','豐原區','水果'
# '30','板橋區','水果'


